In [1]:
import pandas as pd

In [2]:
valores = [6,8, "azyk", {"key":"value"},(3,)]
indice= range(len(valores))
serie1= pd.Series(data=valores, index=indice)

0                   6
1                   8
2                azyk
3    {'key': 'value'}
4                (3,)
dtype: object

In [17]:
valores11 = [6,8, 12,40,5]
serie11=pd.Series(data=valores11, index=indice)
serie11

0     6
1     8
2    12
3    40
4     5
dtype: int64

In [3]:
pd.Series(valores,indice)

0                   6
1                   8
2                azyk
3    {'key': 'value'}
4                (3,)
dtype: object

In [18]:
valores2=[28,45, 742, 3, 16]
serie2= pd.Series(data=valores2, index=indice)
serie2

0     28
1     45
2    742
3      3
4     16
dtype: int64

In [19]:
serie11 + serie2

0     34
1     53
2    754
3     43
4     21
dtype: int64

In [20]:
serie11/serie2

0     0.214286
1     0.177778
2     0.016173
3    13.333333
4     0.312500
dtype: float64

In [21]:
serie11**serie2

0   -1823562080465190912
1                      0
2                      0
3                  64000
4           152587890625
dtype: int64

In [23]:
import numpy as np

In [26]:
array=np.random.normal(-10,19,size=[4,4])
array

array([[-41.73633251,   8.51327648,  -9.50931134, -23.53317079],
       [-17.33175703, -10.28971794,  46.79275386,  -9.52842552],
       [-26.96960056,  11.07097749, -30.49633737, -19.89274204],
       [-16.30648951, -29.73130156, -17.6795378 ,   3.6279647 ]])

In [29]:
pd.DataFrame([[2,3],[4,5]], index=["a","b"], columns=["W","X"])

   W  X
a  2  3
b  4  5

In [30]:
pd.DataFrame(array)

           0          1          2          3
0 -41.736333   8.513276  -9.509311 -23.533171
1 -17.331757 -10.289718  46.792754  -9.528426
2 -26.969601  11.070977 -30.496337 -19.892742
3 -16.306490 -29.731302 -17.679538   3.627965

In [71]:
df= pd.DataFrame(array,index=range(1,len(array)+1),  columns=["W","X","Y","Z"])
df

           W          X          Y          Z
1 -41.736333   8.513276  -9.509311 -23.533171
2 -17.331757 -10.289718  46.792754  -9.528426
3 -26.969601  11.070977 -30.496337 -19.892742
4 -16.306490 -29.731302 -17.679538   3.627965

In [37]:
df["X"]

1     8.513276
2   -10.289718
3    11.070977
4   -29.731302
Name: X, dtype: float64

In [38]:
df.X

1     8.513276
2   -10.289718
3    11.070977
4   -29.731302
Name: X, dtype: float64

In [42]:
df[["W","Y"]] ##slicing mas columnas de interes

           W          Y
1 -41.736333  -9.509311
2 -17.331757  46.792754
3 -26.969601 -30.496337
4 -16.306490 -17.679538

In [66]:
## 1er corchete slicing de columnas
columnas = ["W","Y"]
df[columnas]

           W          Y
1 -41.736333  -9.509311
2 -17.331757  46.792754
3 -26.969601 -30.496337
4 -16.306490 -17.679538

In [83]:
df["suma_X_Z"]= df.X + df.Z
df

           W          X          Z   suma_X_Z
1 -41.736333   8.513276 -23.533171 -15.019894
2 -17.331757 -10.289718  -9.528426 -19.818143
3 -26.969601  11.070977 -19.892742  -8.821765
4 -16.306490 -29.731302   3.627965 -26.103337

In [67]:
df.drop("Y",axis=1) ##para borrar tengo que especificar que columna, y especificar el eje (x=1)

           W          X          Z   suma_X_Z
1 -41.736333   8.513276 -23.533171 -15.019894
2 -17.331757 -10.289718  -9.528426 -19.818143
3 -26.969601  11.070977 -19.892742  -8.821765
4 -16.306490 -29.731302   3.627965 -26.103337

In [82]:
df

           W          X          Z
1 -41.736333   8.513276 -23.533171
2 -17.331757 -10.289718  -9.528426
3 -26.969601  11.070977 -19.892742
4 -16.306490 -29.731302   3.627965

In [72]:
##si queremos que borrado sea permanente (inplace=true)
df.drop("Y",axis=1, inplace=True)
df

           W          X          Z
1 -41.736333   8.513276 -23.533171
2 -17.331757 -10.289718  -9.528426
3 -26.969601  11.070977 -19.892742
4 -16.306490 -29.731302   3.627965

In [73]:
df.drop(3,axis=0) ## quitamos filas (recuerda no permenentemente)

           W          X          Z
1 -41.736333   8.513276 -23.533171
2 -17.331757 -10.289718  -9.528426
4 -16.306490 -29.731302   3.627965

In [74]:
df

           W          X          Z
1 -41.736333   8.513276 -23.533171
2 -17.331757 -10.289718  -9.528426
3 -26.969601  11.070977 -19.892742
4 -16.306490 -29.731302   3.627965

In [75]:
## acceder a filas con .loc
df.loc[3]

W   -26.969601
X    11.070977
Z   -19.892742
Name: 3, dtype: float64

In [78]:
df.iloc[0] ## con el indice que no definimos

W   -41.736333
X     8.513276
Z   -23.533171
Name: 1, dtype: float64

In [79]:
df.iloc[[0,2]]

           W          X          Z
1 -41.736333   8.513276 -23.533171
3 -26.969601  11.070977 -19.892742

In [80]:
## acceder a un valor especifico 
df.loc[3,"X"]

np.float64(11.07097748981839)

In [84]:
df.loc[[2,4],["X","suma_X_Z"]]

           X   suma_X_Z
2 -10.289718 -19.818143
4 -29.731302 -26.103337